examples/05_contraction_sedimentation/0.org/f
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      f;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topOpen
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            zeroGradient;
    }

    contractionWall
    {
        type            zeroGradient;
    }

    xMinWall
    {
        type            zeroGradient;
    }

    xMaxWall
    {
        type            zeroGradient;
    }

    zMinWall
    {
        type            zeroGradient;
    }

    zMaxWall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
