examples/05_contraction_sedimentation/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  8                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//momentumSource
//{
//    type            meanVelocityForce;
//    selectionMode   all;
//    fields          (U);
//    Ubar            (0 -0.003 0);
//}

gravity
{
    type            buoyancyForce;
    active          true;
    selectionMode   all;         // or cellZone, cellSet, points
    fields          (U);         // Name of velocity field
    rho             rho;         // Name of density field
    g               (0 -9.81 0); // Load g value from constant/g
}

// ************************************************************************* //

